In [1]:
import numpy as np
import pandas as pd

In [7]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [8]:
df = pd.DataFrame(data)

In [9]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [24]:
df.groupby('Company')

In [10]:
df.groupby('Company').mean() #pandas groups by the company column and get the mean of the sales column
                             #pandas recognises that the sales column has integers hence ignores the Person column as 
                             #the mean method wont work on a string

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [11]:
byComp = df.groupby('Company') #byComp is a dataframe grouped by company

In [12]:
byComp.sum() #notice a dataframe is returned with an index of the groupby input

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [13]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [14]:
df.groupby('Company').sum().loc['FB'] #all on one line

Sales    593
Name: FB, dtype: int64

In [15]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [17]:
df.groupby('Company').count()  #notice the index is alphabetical

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [19]:
df.groupby('Company').max() #the Person returned is in alphabetical order. Max returning the name closest to the end of 
                            #the alphabet

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [20]:
byComp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [21]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [22]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [23]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64